{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-5-100",
            "title": "Implementing GraphQL Subscriptions for Real-Time Updates",
            "studentName": "Jacob Ryse ",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Michael Stiber",
            "posterLink": "posters/csse/rysejacob_4018928_108461858_Slide1.jpg",
            "abstract": "More and more, end-users desire real-time interactions with their applications. GraphQL, a flexible query language for API's, has become one of the best options to provide a service to developers to seamlessly create efficient data retrieval. Additionally, it provides a key feature in implementing real-time updates: GraphQL Subscriptions. This presentation strives to highlight the significance of GraphQL Subscriptions in producing real-time updates to end-users by explaining how this was achieved during my internship at PNNL. Participants will learn about how subscriptions enable live data streaming, removing the need for polling mechanisms, and thus reducing overall server load. As well as understanding examples of how this technology can be used in web applications, we will discuss the inner workings of GraphQL subscription types, resolvers, and WebSocket protocol. In combination with standard asynchronous technologies, the outcome of my project over the course of these ten weeks displays the importance of GraphQL Subscriptions in satisfying not only the developer, but the end-user. Some additional topics that will be discussed regarding my project include background of the project and company, PNNL, working on a development team using scrum, and the process I took to implement my project into a production application"
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-5-115",
            "title": "Developing Graph-Based Systems with Graphitti",
            "studentName": "Andrzej Dawiec",
            "studentMajor": "CSSE",
            "projectType": "Faculty research",
            "facultyAdvisor": "Dr. Michael Stiber",
            "posterLink": "posters/csse/dawiecandrzej_4020149_108495890_Andrzej Dawiec Capstone Graphitti Poster 1.png",
            "abstract" : "The Intelligent Networks Laboratory ran by Professor Michael Stiber aims to understand computational neuroscience and apply that knowledge towards a wide range of problems. Under Professor Stiber’s guidance, I worked with a team of graduate and undergraduate students on the Graphitti project which leverages desktop hardware to perform supercomputing capabilities. \n\nHaving the ability to run on CPU and GPU applications, my main objective is to benchmark the build efficiency of the Graphitti simulation. On a single core CPU, such as the GitHub testing space simulation, the build took roughly three minutes to compile. With multi-core CPUs in use, the build time reduces to around twenty seconds – An 86 percent improvement of the build time. This change led to significant improvements in the performance of the Graphitti simulation. Given that the Graphitti project has uses in 911 public safety systems, high performance is critical for these types of systems. I was also given the responsibility of updating the documentation for the system, which helped me learn both technical and non-technical skills. \n\nThis project also allowed me to collaborate with others through the code via GitFlow. Working on a large-scale project with multiple people, it can be hard to track new features along with implementing them into the main code. With GitFlow, I drew up the documentation with tools such as PlantUML in order to clean up the code and improve the project for incoming students. \n\nOverall, this project provided me with valuable learning experiences in addition to the technical coding skills I gained with such a large data program. Working on a project that has been well-developed already, it was essential to gain a deep understanding of the codebase in order to identify areas to improve and document. \n\nAfter deep-diving into a variety of issues in Graphitti, this project offered technical knowledge and valuable experiences in teamwork, communication, and project management which I will carry towards future engineering experiences. "
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-5-130",
            "title": "Empowering Growth: Agile Cloud Solutions and Decision-Making in a Tech Startup",
            "studentName": "Kevin Carlson",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "posters/csse/carlsonkevin_LATE_3748300_108509950_CapstonePoster-1.png",
            "abstract": "In my Capstone project with the innovative startup Smash Group LLC., I have had a multifaceted role as the team lead and acting project manager, taking charge of pivotal responsibilities, including decision-making, collaboration, and team building. It has been an immersive experience where being a leader and decision-making have a real difference in driving the startup's success. \n\nCentral to the project was the analysis of alternatives, where I carefully evaluated various Azure services, capitalizing on my certification in Azure Fundamentals from Microsoft. The Cloud Team meticulously evaluated and selected the most suitable technologies, ensuring seamless implementation of our chosen solutions. \n\nThe project's primary focus was the development of a dynamic web application, which necessitated rapid prototyping to keep pace with the fast-moving startup environment, enabling us to adapt quickly when needed. My contributions to Internet application development were bolstered by the strategic use of industry-standard tools like VSCode, GitHub, and Figma. \n\nMoreover, I actively engaged in comprehensive database design, crafting an efficient Entity-Relationship Diagram (ERD) and building a robust database infrastructure tailored to Smash's unique requirements. The seamless integration of the web application with the SQL database was a significant accomplishment, ensuring smooth data interaction. \n\nWe’ve successfully used agile methodologies, utilizing Linear, enabling the team to achieve productivity and collaboration excellence during sprints. Effective communication was fostered through the skillful utilization of Discord, with dedicated team channels, and Google Drive for streamlined document sharing and notes. \n\nOne notable highlight of the project was securing Smash's entry into the prestigious Microsoft for Startups Program, unlocking $5000 worth of Azure Credits and additional benefits like GitHub Enterprise and OpenAI credits. \n\nThis capstone experience facilitated my professional growth, empowering me with cloud architecture expertise through my Azure certification, while also equipping me with a diverse set of practical skills that align perfectly with real-world industry demands. As I reflect on this enriching journey, I am confident that it will serve as a cornerstone in my career trajectory, propelling me toward a future filled with new challenges and remarkable achievements in the technology domain."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-5-145",
            "title": "Accolade Software Engineering Internship",
            "studentName": "Tristan James Commons",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship or job opportunity",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "posters/csse/commonstristanjames_4007074_108488600_Capstone Poster - Tristan Commons.jpg",
            "abstract" : "Over the summer I completed a software engineering internship at Accolade, a medical technology company. Accolade provides a variety of tech-based healthcare services primarily for businesses and their employees. I worked on the data ingestion software team and was responsible for developing a suite of software solutions to more quickly and efficiently onboard new customers and their data. I managed to accomplish this goal and was able to create tools that are now being used to more quickly, efficiently, and intuitively, ingest customer data, both reducing the strain on the engineers and reducing costs for the company. This in turn allows Accolade to provide their services to more customers and give them a smoother onboarding experience."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-5-200",
            "title": "Software Engineering Internship at Develop For Good",
            "studentName": " Rachel Ann Graham",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "posters/csse/grahamrachelannferrer_4026281_108490293_Rachel_Graham_CSS497_Poster.png",
            "abstract" : "CHANGE Arts, a non-profit organization, aims to make arts access limitless. The arts have been a societal resource for all of documented history. It calls for citizens to come together and see reflections of the world played back to them. To preserve this tradition and the responsibility that we have to ourselves and to each other, the link of humanity demands our constant attention and continued compassion. Meaningful and lifelong arts access is therefore essential if we are to expect reflection, empathy, and joy. \n\nIn order to fulfill this goal, my team and I have built an arts search engine and website, Find Your Art (FYA). It allows CHANGE’s partners to post their arts events and enables educators to easily and efficiently locate these events for their students to attend. To further make arts more accessible, CHANGE will also provide the option of ticket subsidization if educators/schools do not have the budget for the price of the event. For this iteration of the website’s development, we have built the main features, such as account creation/login, homepage, and search functionality, using Figma, React, Node.js, Express, and MongoDB.\n\nWhile there are still more features to include for the next iteration of this project before the website can be fully launched, I believe our team was successful in transforming a client’s ideas into a working product. We built just the beginning of an ongoing project that will soon change the way we experience and value the arts, as well as how accessible the arts are to the public. Additionally, there are currently no websites that solely feature local arts events or provide the functionalities and benefits of FYA, therefore this website will be widely used and valuable to CHANGE’s arts organizations and educators from all over the country."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-5-215",
            "title": "Toast Software Engineering Internship",
            "studentName": "Safwaan Taher",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "posters/csse/tahersafwaan_3824599_108491715_Safwaan-Taher-Capstone-Poster-2023.png",
            "abstract": "Toast Inc. is a leading technology provider in the restaurant industry, offering a comprehensive suite of solutions including management, payments, insights, menus, and more. During my internship, I was a part of the Restaura nt Platform Team, which played a pivotal role in reshaping the backend architecture, transitioning from a monolithic structure to a dynamic microservices framework powered by technologies like DynamoDB, RPC, and other APIs. \n\nOur primary objective was to enhance the efficiency and scalability of the backend, a crucial aspect for Toast's web and mobile teams. This endeavor primarily involved the gradual migration of the backend platform from a monolith to a microservice-oriented architecture. This transition significantly improved the efficiency and speed of the backend platform, which was previously impacted by a high volume of requests as Toast continued to scale. \n\nMy responsibilities within the team encompassed a diverse range of tasks. These included optimizing hardware allocations, improving system performance, addressing RPC bugs, and developing custom functions for deprecated libraries as we upgraded our technology stack. Leveraging my skills in Java and acquiring new ones in Kotlin, I crafted enterprise-grade code to tackle the aforementioned challenges. An integral part of my contributions was the implementation of a robust testing approach. I utilized both proprietary and in-house testing software to meticulously review my code, maintaining its integrity through industry-standard testing pipelines such as Jenkins and GitHub Actions. \n\nBy working closely with my team, I achieved several accomplishments and rigorously tested my solutions in the sandbox, preproduction, and ultimately, production environments. The most tangible validation of my efforts was witnessing my contributions being deployed to production servers, effectively addressing real-world scenarios, and underscoring the value of my work. As I write this, my internship has concluded, but the dedicated platform and services teams at Toast persist in their pursuit of scaling and optimization efforts."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-5-215",
            "title": "Local Language Processing",
            "studentName": "Dominic Portolese ",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Marc Dupuis",
            "posterLink": "posters/csse/portolesedominicsebastian_4001321_108485733_QuadChartPortoleseWithPictures 1.png",
            "abstract" : "During this internship I developed both a summarizer and retrieval augmented generation program using natural language processing. I used pretrained models and configured them with many different strategies to improve the speed and effectiveness of their use for the purposes of summarization and retrieval augmented generation.      \n\nThis was done in order to improve the productivity of certain secretarial tasks within the US Navy. The Navy is a massive organization where many people correspond on a daily basis. In addition to this, large databases of testing and historical data need to be solicited for information. This is a slow process because much data has to be searched through, and this searching has to be done by a subject matter expert who can accurately interpret the data. These programs seek to reduce the time required and the knowledge level required to retrieve accurate information. I chose natural language processing as the active ingredient in solving this problem because it is the most effective tool we have for bridging the gap between computer and human comprehension of text.      \n\nThe result is a solid platform to test further models on. These models can be optimized for their purposes using the supercomputers available to the US Navy. Once these optimizations have been put into place, they can be further developed into end user products not only to accelerate the rate that work is accomplished in the Navy, but the whole Department of Defense and beyond.       \n\nThis is significant because unlike private corporations, the US Navy is both tax funded and relied upon for national security. This means that it is of the utmost importance to all Americans that it operates efficiently and effectively. These productivity tools, once fully implemented, will greatly improve both of these aspects."
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-5-215",
            "title": "Software Engineering Internship at Kapittx",
            "studentName": "Tarun Veeraraghavan",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Marc Dupuis",
            "posterLink": "posters/csse/veeraraghavantarun_3942843_108494795_poster.jpg",
              "abstract": "In Business-to-Business (B2B) firms, Accounts Receivable remains among the top three tangible assets on the books; yet it is highly under-managed, leading to cash getting locked in the balance sheet. Businesses end up spending hours on manual, repetitive tasks, updating multiple spreadsheets, preparing cash flow reports, handling invoice disputes, or manually reconciling invoices. Using Accounts Receivable automation integrated with B2B payments, Kapittx is empowering collection and customer-facing teams to collect payments faster and more efficiently than before.\n\nWhile the Kapittx data ingestion systems captures the sync statistics regarding the records for a customer’s or invoice’s syncs, the platform is unable to proactively indicate the issues in these sync batches. During a sync process, the data ingestion layer that sources data from the Enterprise Resource Planning (ERP) layer, stores information about how the requests were received and how many records during the sync passed/failed or were processed/unprocessed. The goal was to build a solution that is automated and proactively highlights issues in the sync batches.\n\nWe engineered a Sync Statistics API that will proactively provide the details on the sync batches, aiding Kapittx’s customer success functions in dealing with issues in sync. The tech stack consisted of the API which was built using Java, Spring Boot and MySql. Later, Postman was used to test the API.\nThe inputs to the API consists of:\n1. A Kapittx subscriber company\n2. The date of sync\n3. The sync operation type ('create invoices', 'update invoices', 'create customer', 'update customer', etc.)\nThe Processing logic consists of three layers:\n1. The Controller component that receives the API request and delegates the request to the Service component.\n2. The Service component preprocesses and validates the request and delegates the messaged data to the Repository component.\n3. The Repository component then connects to the MySQL database and fetches the required information back to the service component and eventually to the Controller component.\nOverall, this experience has provided me with valuable insight into the entire process of the software development cycle and a higher understanding of API architecture. By getting a hands-on experience with databases and the various API layers, I received the necessary skills required to further contribute to the advancement of software engineering."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-5-215",
            "title": "The Art of Testing",
            "studentName": "Leanne Vu",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Marc Dupuis",
            "posterLink": "posters/csse/vuleanne_LATE_4141877_108554609_Vu_Leanne_Capstone_Poster-1.png",
            "abstract": "My three-month internship at Fiduciary Tech unveiled the fundamental elements of a contracting firm specializing in Salesforce-focused technology. The focus was directed towards understanding the role of a quality assurance (QA) tester, project management roles in connecting different teams, and their alignment with the company's values and client engagement. \n\nThe overarching goals were twofold: first, to comprehend how Fiduciary Tech uses their Salesforce expertise to accomplish maintaining and creating products for their clients and second, to uncover the symbiotic relationship between QA testing, clear communication, and effective project management. This dual-pronged investigation aimed to understand the various roles within Fiduciary Tech's area of specialization. \n\nThroughout this exploration, I gained insight concerning the pivotal role of QA testing in ensuring software reliability. The iterative testing process, encompassing various scenarios, highlighted defects due to testing at each development phase. Moreover, the role of quality assurance starts a streamline of conversations, decision making, and action items that maintained the timeline of the project. \n\nThroughout my internship, I gained a deeper understanding of what Salesforce is, how the various roles at Fiduciary collaborate, and the value of everyone’s contribution to meet and understand business requirements. Internal and external meetings determined what business requirements were and clarified action items within teams and testing interactions and integrations between different components and modules minimized risk of errors in completing these business requirements. Together, it led to the confidence of deployments through different environments at a quick rate. \n\nThese insights hold importance for tech companies striving for sustainable success amidst a changing industry landscape. Furthermore, this exploration offers practical insights for cultivating cohesive cross-functional collaboration, an essential aspect in the context of clients that need Salesforce consulting."
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-5-215",
            "title": "The Relationship Between Subjective Well-being and the Social Media in Youth Group",
            "studentName": "Qihou Zhang",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Marc Dupuis",
            "posterLink": "posters/csse/zhangqihou_3948110_108414202_posterIMG.jpg",
            "abstract": "This research investigates the correlation between social media usage and subjective well-being among the youth. The study aims to understand the psychological characteristics of social media users, focusing on their emotional value, user features, behavioral features, and the impact of these factors on their subjective well-being.\n\nThe research is grounded in the theoretical definition of happiness, which is divided into two criteria: defined by extrinsic criteria and defined by subjective criteria. The study explores subjective happiness, referring to an individual's overall assessment of their life circumstances and standard of living. It further breaks down subjective well-being into three factors: life satisfaction, positive emotions, and negative emotions.\n\nThe study also examines the influence of social media usage on subjective well-being. It explores two hypotheses: the replacement hypothesis, which posits that more online socializing reduces offline socializing and thus happiness, and the gain hypothesis, which suggests that online interactions on social media increase happiness by breaking through the limitations of time and space.\n\nThe research methodology involves data acquisition from social media platforms and psychometric scales filled out by users. The study adheres to ethical guidelines, ensuring users' privacy and authorization for access.\n\nThe findings of this research will provide insights into the impact of social media usage on the psychological well-being of the youth, offering valuable suggestions for individual social media use behavior and mental health interventions. The research also has implications for the design and construction of social media platforms, aiming to maximize their positive role.\n\nFor my research, I delved into numerous articles on the relationship between personality and social media usage. My choice to focus on \"The relationship between subjective well-being and social media in youth group\" was heavily influenced by Professor Marc's article. This topic piqued my interest, and I was eager to explore new dimensions based on his findings. While I incorporated data and results from various sources, I did not personally collect this data. As a college student, gathering such extensive personal information is challenging. Instead, I leveraged existing data from professional scholars and research teams. Using this data, I formulated several hypotheses. My analysis revealed that while some of these hypotheses were supported, others were refuted."
        }
    ]
}

