{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-1-100",
            "title": "Design Notification Panel for Prism Central",
            "studentName": "Mohammed Al-Azadi ",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "posters/csse/alazadimohammed_4108406_108494625_Poster  Large.jpeg",
            "abstract": "Nutanix aims to provide a single, simple, open software platform for all hybrid and multi-cloud applications and their data. The purpose of this internship to solve the problem of responsiveness within Prism Central. As a UX Designer I needed to use my skills to make Prism Central feel more responsive and real time to the users. Throughout the years Nutanix customers have complained that Prism Central doesn’t feel live when working on it.  \n\nThe initial phase, I delved into empathizing with the user and understanding the problem at hand. This involved interacting with various individuals within the company to gather crucial data that could aid in addressing the issue effectively. Additionally, I conducted a competitive analysis to gain insights into Nutanix competitors' strategies. Engaging with different perspectives was fascinating, although identifying the competitors and understanding their market edge proved to be a significant challenge. Nonetheless, I found solutions to these obstacles. \n\nThe second phase was one of the highlights of my internship. I participated in the Nutanix U-Hack hackathon, collaborating with other interns to work on a project aimed at improving Nutanix. This collaborative setting reminded me of my university and added an element of excitement to the experience. My team faced the challenge of managing time efficiently and meeting project deadlines, but our hard work paid off as we secured an impressive 2nd place in the hackathon. This achievement brought a sense of accomplishment and boosted my confidence.\n\n The third phase, I focused on brainstorming solutions for the problem statement. Engaging in the crazy 8 design sprint and developing lo-fi prototypes was a novel experience for me, as I usually worked in a group during my classroom settings. Then the lo-fi prototypes translated to the hi-fi prototypes via the use of Figma. The main challenge during this phase was generating eight unique and viable ideas to address the problem. Despite the challenge, I enjoyed the process of working individually and came up with innovative solutions.\n\nTo conclude, I'm grateful that I was able to work on an issue that really needed to be resolved and make an impact in my short 10 weeks. This internship holds immense significance in my professional growth because it helped improve my skills that consist of but not limited to UX research, user experience, communication, requirement analyses, prototyping, wireframing, and Figma. I look forward to applying the lessons learned in future endeavors."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-1-115",
            "title": "Identity Management Task Dashboard",
            "studentName": "Ali Al-Azadi",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "posters/csse/alazadiali_4108398_108495251_Capstone Poster.jpg",
            "abstract": "Lumen Technologies, formerly known as CenturyLink, is a telecommunications and technology company that provides a range of services to businesses, government organizations, and consumers. Lumen offers solutions in areas such as network connectivity, cloud services, cybersecurity, data center services, and communication technologies. The internship encompassed active involvement in one main project within the Identity Access Management (IDM) team. My main project was to create an IDM work dashboard, designed to comprehensively monitor individual team members' activities. After researching different tools to create the dashboard I came across Microsoft PowerApp. PowerApps is a Microsoft platform that allows individuals and businesses to create custom applications without the need for extensive coding or development skills. It enables users to design and build apps that connect to various data sources, such as databases, cloud services, and online platforms, to streamline processes and improve productivity. The reason why I chose PowerApps is because it was part of the Microsoft ecosystems which allowed me to easily connect it to Microsoft Teams chat, which is what the team used to communicate. This dashboard eventually played a pivotal role in identifying workload trends and generating informative reports for upper management, highlighting crucial aspects of the team's tasks.\n\n  Although PowerApps allows you to create apps without extensive programming, I had to develop a feature that required me to use HTML programming. The feature was to schedule a flow that sends a report to the team lead every day that illustrates what team members worked on what task. The process of learning how to use PowerApps and launching the beta version of the dashboard occupied the first half of my time at Lumen. The second half of my internship consisted of presenting the IDM work dashboard to the team and improving its features based on feedback from the team. Collecting feedback was mainly conducted through meetings. One of the main improvements that happened through this process was the enhancement of the feature that was used by team members to log in what task they were working on.\n\nOverall, the results of the internship were multifaceted and impactful. The IDM work dashboard provided a centralized monitoring mechanism, facilitating the identification of workload trends and generating informative reports for upper management. The successful launch and publication of the add-on in the team's chats showcased my dedication to the project. Despite facing challenges with learning how to efficiently use PowerApps, the proactive approach to debugging and updating the app contributed to improved performance. \n\nThe significance of the internship lies in the valuable contributions made to the IDM team's efficiency and effectiveness. The developed dashboard and add-on introduced streamlined monitoring and communication, optimizing decision-making processes and resource allocation. The incorporation of feedback exemplified a proactive problem-solving approach, enhancing the overall functionality and productivity of the team's tasks.\n\nIn conclusion, the internship involved meaningful endeavors in developing the IDM work dashboard, and actively engaging with team members to improve app functionality. The results showcased my commitment to excellence, highlighting the project's significance in enhancing team efficiency and communication throughout the internship while showcasing my skills in development, design, and project management."
        
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-1-130",
            "title": "Full-Stack Development for FPT Software",
            "studentName": "Cuc Thi Doan",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Min Chen",
            "posterLink": "posters/csse/doancucthi_4145858_108491597_Poster-1.png",
            "abstract" : "During my internship at FPT Software Company, I undertook the task of building an internal website for the organization with the primary objective of improving employees' ability to efficiently search for documents related to company resources. The necessity for this project stemmed from the increasing volume of information within the company and the corresponding challenges employees faced in retrieving relevant data swiftly.\n\nThe project's purpose was to enhance information retrieval, foster collaboration, and ultimately boost overall productivity within the organization. By providing a centralized platform for accessing essential documents, employees could access the information they needed promptly, enabling them to make informed decisions and streamline their workflows effectively.\n\nTo achieve this goal, I employed various algorithms specifically tailored to the needs of each role in the company. This approach ensured that employees received personalized and accurate search results, saving time and effort while maintaining a seamless user experience.\n\nMoreover, recognizing the importance of data security, I implemented robust cybersecurity techniques to safeguard sensitive information from potential outside attackers. This involved adopting industry-standard encryption protocols, access control mechanisms, and continuous monitoring to ensure the website's integrity and protect confidential data.\n\nThe significance of the project lies in its contribution to the organization's operational efficiency and employee productivity. By equipping employees with a powerful tool for accessing critical resources, the internal website fostered a collaborative and knowledge-sharing culture, transcending traditional information silos. It not only empowered employees to work more efficiently but also facilitated better decision-making processes across the company.\n\nOverall, my internship project at FPT Software Company demonstrated the successful development and implementation of an internal website with sophisticated retrieval algorithms and robust cybersecurity measures. The project's outcome has proven to be a valuable asset for the organization, reinforcing the importance of effective information management in a technology-driven business landscape."
            
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-1-145",
            "title": "League Of Legends Item Guide Creator Website",
            "studentName": "Andy Zhong",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Min Chen ",
            "posterLink": "posters/csse/zhongandy_4107209_108493336_Capstone poster-page-001.jpg",
            "abstract" : "The competitive nature of games like League of Legends (LoL) has given rise to a demand for data-driven tools to optimize gameplay. To address this, a program was developed to create an item guide tailored for individual players based on their play style and champion preferences. The algorithm leverages the Riot Games API to fetch and analyze match data for specific players, champions, and positions.\n\nInitially, the program fetches the unique player identifier, PUUID, based on the summoner name provided. Using this PUUID, match IDs associated with the player are retrieved. The program then navigates through these matches, focusing specifically on the player's chosen champion and position. Once the relevant matches are pinpointed, an item timeline is extracted, documenting item purchases made during the course of the game.\n\nSubsequent analysis segregates these items into the % of times they were purchased at which item slot and situational items based on their purchase timings and frequencies. This analysis helps identify common items for each item slot and the sequential purchase trends of the player, giving insights into player's in-game decision-making.\n\nThe findings are then structured into an item guide, presented in a JSON format. This guide delineates common starter items and suggests purchase sequences based on historical data, offering percentages that denote purchase likelihood. Situational items, being non-sequential purchases made on a case-by-case basis, are also highlighted with their respective purchase rates.\n\nIntegration of the Flask web framework, SQL Alchemy for data management, and HTML for the front-end interface makes the program user-friendly. Users can input their summoner name, champion, and position and instantly receive a custom item guide based on their past games.\n\nThis program, through its detailed analysis and user-friendly interface, empowers League of Legends players to refine their gameplay strategies, drawing from their own historical data and tendencies."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-1-200",
            "title": "Full-stack Time Management Development",
            "studentName": "Benjamin Olson",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Min Chen",
            "posterLink": "posters/csse/olsonbenjaminc_3958642_108494894_PosterBenjaminOlsonSummer2023.png",
            "abstract": "Throughout this capstone project I had the opportunity to build a prototype of a time management application designed specifically for a small contracting company, Pacific Outdoor Living. The motivation for this project was to address pain points the company was experiencing with their software, add features lacking from other software available on the market, and to eventually combine functionality from multiple software applications all into one place. \n\nThe process towards accomplishing the project’s goal as a solo developer began with interviews and observation of the software systems currently in place at the company, which I used to create an initial wireframe and design documents. From there the iterative process of applying user feedback and continuing development began. \n\nThe result of the project was an unpolished but functional prototype of an interconnected mobile and web application. I am currently looking to continue fleshing out the prototype and continue working on the application beyond the end of my capstone project. \n\nThroughout the process of designing this system I was able to improve my technical skills as well as soft skills relevant to software engineering. Building up this prototype was not only the first true full-stack project I’ve worked on, but also easily the most complex one. This gave me a phenomenal chance to apply knowledge gained from my UWB courses to solve real world problems in addition to developing new skills based on practical experience. "
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-1-215",
            "title": "Android APP Development",
            "studentName": "Fangzhi Yuan",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Min Chen",
            "posterLink": "posters/csse/yuanfangzhi_4170478_108474491_poster (1).png",
            "abstract" : "My Capstone is to develop an accounting software that belongs to the Android platform. The main focus of this software is to count the expenses of software users and calculate the cashback that credit cards can bring.\n\nI noticed that there are a lot of accounting software available for download, but none of them are mainly focused on calculating credit card cashback, so I decided to develop such a software myself, this software performs data analysis based on the data entered by the user, and display the results visually to users and give some suggestions.\n\nIn order to achieve this goal, I used the agile development method by combining the relevant knowledge learned in school courses. During the development process, I used Andriod Studio and GitHub to complete the overall development of the accounting software, and passed multiple user tests , gradually adding various functions and visual chart schemes, adding pie charts for the analysis of consumption data types in the current month and bar charts to display consumption trends in the past year, and optimizing functions with low practicality but high learning costs for users. For example: Point system. Fixed bugs such as date display errors, statistical data missing unexpectedly, and recommendation algorithm errors.\n\nI not only enhanced my understanding of related knowledge but also understood many differences between theory and practice in this process. At the same time, during the development process, I also made deep thinking about my future career development direction. The knowledge, experience, and thinking I have learned from it will have a great impact on my future life."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-1-230",
            "title": "SAP Internship for Puget Sound Energy",
            "studentName": "Aislinn O'Connell",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr Min Chen",
            "posterLink": "posters/csse/oconnellaislinn_LATE_3895167_108496029_PSE_Poster_OConnell_Aislinn.png",
            "abstract": "During my time at Puget Sound Energy (PSE) as an SAP intern, I worked with the functional SAP team to ensure that SAP is supporting the necessary business actions that are used to keep PSE functioning smoothly. SAP is the enterprise software that supports PSE’s business needs by connecting all the departments, and keeping accurate records that are updated instantly across all departments. My role was to learn about how to navigate SAP, and work on a project where the objective was to make sure that material entry was synchronized across all web platforms. \n\nMy project required me to ensure that the material codes that are used in Ariba, a web-based enterprise software that inputs into SAP, correspond to the correct material codes within SAP. This project is important because when work orders are made in Ariba, and materials are needed or going to be used, it is critical that it corresponds to the materials listed within SAP. If there is a mismatch on the material code between SAP and Ariba then the necessary materials may not be marked as absent, or the order may go through. Ariba and SAP are used by different teams within PSE so it is imperative that the overall material stocklist is maintained accurately. \n\nThe project outlined above, has helped me understand how Ariba and SAP interact, and how the work orders move across the enterprise software to reach different departments within PSE. Being able to see the inception of a work order, to the creation, and finalization off the work order, has allowed me to better understand how business operations are managed at a multi-department business, and the importance of enterprise software to create an efficient business structure. "
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-1-245",
            "title": "Project Detect AI",
            "studentName": "Daniel James Clarke",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr Min Chen",
            "posterLink": "posters/csse/clarkedanieljames_4198304_108489546_CapstonePoster.jpg",
            "abstract": "In my individual project, I worked on creating a browser extension built for chromium browsers that uses a trained machine learning model to detect and highlight product reviews that may have been generated by AI.\n\n The machine learning model was trained on a labeled dataset with half human generated reviews and half AI generated reviews. Before the training the model removes all punctuation to remove unnecessary variables. Then the model tokenizes the text into numbers that it can understand easily and teaches itself methods of associating different elements with AI or Humans. \n\n Once the model is trained, I use Microsoft's Azure function app hosting service to host a function that can receive text via HTML requests, feed it to the model and then respond with whether it is AI or Human and how certain it is.\n\n The extension works by checking if a page is supported, identifying which HTML tags to look for and then scanning the page for all reviews, it then sends the text to the model where it classifies the text as AI or human and responds with this information. The extension colors the text green or red according to its classification. For any page that is unsupported, there is a manual option where the user can select and send text to the model to be classified.\n\n The goal of this project was to create an easily usable product built directly into the browser. There are already many websites where users can enter in text to check if it's AI, but there are few extensions that do the same. I specifically focused on product reviews to make it easier to train a model on it and because that is a market with a high density of bot-generated content."
        
        
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-1-300",
            "title": "Language Learning App: Polyglot Go",
            "studentName": "Andrew Chou",
            "studentMajor": "CSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Dr Min Chen",
            "posterLink": "posters/csse/chouandrew_4170508_108491277_CSS 497 Capstone Poster.png",
            "abstract": "For our capstone, we were working in a group of two to create a language learning app called “Polyglot Go” which run on platform such as desktop, iPad, and iPhone.\n\nIn a world increasingly defined by linguistic diversity, language barrier has become a main issue for everyone especially for the newly transferred or admitted students. Due to this, learning new languages, cultures, and making new friends have emerged as a real challenge. However, this should not present an obstacle to prevent one’s passion; we believe learning new language and cultures should be fun and simple. This would be the core objective for our project, which is to make the learning process easier and more enjoyable.\n\nIn crafting our application, we did various research on finding a more efficient way to write and manage our code files. Our strategic choice was made to employ “FlutterFlow” as the main development environment. The choice stems from the uniqueness of the platform to seamlessly meld visual design (Front end) with underlying Dart code (Backend), resulting in dynamic and responsive user interfaces. Moreover, FlutterFlow gave us the ability to create complex widgets, tools, deploy APIs and interactions that can simulate real-world language usage scenarios (such as our flashcard’s flipping card widget, etc.)\n\nOverall, we utilized FlutterFlow to create 3 different learning types such as Flashcard, wordmatching and Translation; and each learning type supports three different languages such as Chinese (Mandarin), Vietnamese and Khmer (Cambodian). On top of that, we created basic login (sign up) page, home page (language selection), progress page, goal page, etc. Furthermore, it is noteworthy to mention that we used Google Firebase service as our main database to store our user information and language data pack.\n\nIn summary, “Polyglot Go” represents the fusion of innovative technology and creative teaching ideas, offering a more enjoyable approach to language learning. By making language learning fun and easy, we contribute to breaking down barriers and fostering meaningful connections among diverse communities." 
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-1-315",
            "title": "MeTILDA User Interface Faculty Research",
            "studentName": "Ivy Yang",
            "studentMajor": "CSSE",
            "projectType": "Faculty research",
            "facultyAdvisor": "Dr Min Chen",
            "posterLink": "posters/csse/yangivy_4171017_108489959_Yang_PosterMeTILDA.png",
            "abstract":"In my faulty research at the MeTILDA team, I worked on creating a feedback form and sound scales converter interface.\n\nMeTILDA is an ongoing project, and the Create tool is ready for beta. Creating a feedback form could let the MeTILDA team and coworkers know what users think of MeTILDA and how different functions work. Implementing the feedback form feature helps enhance the user experience and collect timely feedback from users to improve product quality. Collecting user feedback is a necessary way to make the project more and more user-friendly. The Converter function interface is designed to enhance the user experience. Improvements in fonts, layouts, and tool descriptions improve the product's usability, making it easier for users to use.\n\nBy writing the feedback form about MeTILDA directly and implementing the front-end code for the converter based on the already completed back-end code, we harvested a roughly completed feedback form and an around-constructed converter. The feedback form and converter can already be used with other MeTILDA features, and both were communicated and modified while implementing them with the professor in charge, the collaborative partner, and the teammates. In this way, we are making these features that are needed to make the user experience a good one even better.\n\nWith the implementation of these two interfaces, MeTILDA users will have a better user experience with the converter and give the team timely feedback on its use. The MeTILDA team will also improve the product according to this feedback to make it better."
        }
    ]
}

