{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-3-100",
            "title": "Prediction of Cardiovascular Diseases Using Machien Learning Algorithms",
            "studentName": "Melaku Tarekegn",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Arkady Retik",
            "posterLink": "posters/csse/tarekegnmelaku_4076188_108494565_Poster.png",
            "abstract": "Cardiovascular diseases are among the leading causes of death worldwide. Cardiovascular diseases include both heart and blood vessel diseases. This research-based project focuses on the prediction of cardiovascular diseases using different machine learning algorithms. Before building the machine learning models, data preprocessing was done to make the prediction and analysis process easier. And then finally, the findings were compared to the previous related works to get the most accurate and valid machine learning algorithms. \n\nIn this project, 20 % of the dataset was used for testing and 80% of the dataset was used for training. And then one of the popular supervised machine learning algorisms which is classification was trained for the prediction of cardiovascular diseases. The target is to predict whether the patient has the probability of having cardiovascular disease or not. To get accurate results, the modeling, as well as the analysis processes, were done with a stepwise approach. Therefore, different types of binary classification algorithms were modeled. These binary classification algorithms were grouped into linear and non-linear models. \n\nFrom linear binary classification models Supportive Vector Machine-Linear Classifier and Logistic Regression were the top two algorithms with 72.16% and 72.13% approximate accuracy respectively. And from binary non-linear classification models; Random Forest Classifier, Supportive Vector Machine-Radial Basis Function Classifier, and Multilayer Perceptron Classifier had the best performance with an approximate accuracy of 82.50%, 73.20%, and 72.67% respectively. \n\nIn conclusion, machine learning models have a significant role in the prediction of cardiovascular diseases. Therefore, researchers, healthcare experts, and computer scientists should work together to bring the application of machine learning to diagnose cardiovascular diseases in every healthcare setting worldwide."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-3-115",
            "title": "Optimization Content: The Envoy Events Capstone Journey",
            "studentName": "Hamza Ahmed",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Arkady Retik",
            "posterLink": "posters/csse/ahmedhamza_4107402_108487961_HamzaPoster-Horizontal .jpg",
            "abstract" : "For my Capstone at Liberty Mutual, I worked with a team of developers on the Envoy Events project, which was a strategic endeavor that aimed to develop a secure cloud management solution, facilitated through a user-friendly RESTful API, to cater comprehensively to diverse content requirements. The core objective revolved around the seamless facilitation of content storage, retrieval, and searching processes, all while upholding paramount data security measures.\n\nThe project's focal points included boosting operational efficiency, curtailing expenditures, and fundamentally refining content management procedures. Central to the project's success was the meticulous revamp of an existing console, a move that yielded significant dividends. Notable outcomes encompassed a marked reduction in errors, the fortification of brand identity, and a markedly enhanced user interface. An innovative wireframe design was judiciously introduced, offering users a trio of search options: Event ID, Event Pipelined ID, and Collection Name. This customized approach to search optimization was instrumental in expediting the entire process, eliciting heightened levels of user contentment.\n\n In summary, the Envoy Events project successfully navigated the complex landscape of content management by seamlessly integrating a secure cloud solution and a RESTful API. The resulting improvements to the console brought about enhanced usability, error rectification, and a more resonant brand image. The strategic inclusion of tailored search alternatives further elevated the overall user experience, providing compelling evidence of the project's notable accomplishment."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-3-130",
            "title": "Machine Learning Model For Price Markup Tool",
            "studentName": "Ray Xia",
            "studentMajor": "CSSE",
            "projectType": "Sponsored internship or job opportunity",
            "facultyAdvisor": "Dr. Arkady Retik",
            "posterLink": "posters/csse/xiaray_4025660_108486699_UW Capstone Poster Final.png",
            "abstract": "At PACCAR, my capstone internship project was focused on creating a machine learning solution to estimate a dealer’s markup in price when selling a truck to a customer. A PACCAR Financial Corporation (PFC) salesperson currently has to take time to manually assess many factors such as buyer history, truck model, credit score, truck condition, and more to make an estimation of the dealer markup when selling a truck to a dealer. To maximize profits, PFC must understand a dealer’s markup to know how much to sell trucks to the dealer. My project automates this process with machine learning and simplifies a salesperson’s job.\n\nI utilized many tools for my project. I programmed in Python, using different tools such as Jupyter Notebook, scikit-learn, pandas, and ydata-profiling for my data exploration and cleaning. After cleaning my data, I selected important variables to make my RandomForestRegressor model and performed hyper tuning to increase accuracy of the model.\n\nAfter my model was complete, it was time for deployment. I used DVC (Data Version Control) for data source control and used GitHub Actions to automate my training, evaluation, and deployment of the machine learning model. I used FastAPI to make an API that accepts parameters to feed to my machine learning model and output an estimated dealer markup. Using GitHub Actions workflows, I was able to automatically create a Docker image of my application and store it on Google Cloud Platform’s (GCP) Artifact Registry, where GCP Cloud Run would use that image to have an accessible web API for PFC.\n\nMy project is still under development, but when my model is ready for production, it will be able to support PFC when conducting sales to dealers. My API will save time and also assist in price negotiations with dealers, with a likeliness in increasing profit margins."

        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-3-145",
            "title": "Smash Software Engineer Intern: Developing A Centralized Platform for Navigating Online Resources and Real-World Projects",
            "studentName": "Benjamin Nguyen",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Arkady Retik",
            "posterLink": "posters/csse/nguyenbenjamin_4230589_108495620_Benjamin_Nguyen_Poster.png",
            "abstract": "Numerous individuals encounter challenges in navigating online resources, platforms, and websites offering learning materials and projects. The sheer volume of information makes it difficult for students to discern the most relevant and high-quality resources, resulting in wasted time and hindering their learning and professional growth.\n\nMy capstone initiative seeks to address this issue by providing students with a centralized platform that offers curated, high-quality resources and projects tailored to their interests and skill levels. Our platform streamlines the search process, empowering students to focus on their learning journey and make contributions to real-world projects. By facilitating meaningful connections between students and their desired companies, we aim to build a bridge that allows students to showcase their dedication and skills without requiring direct employment.\n\nDuring this internship with the startup Smash Group LLC., I took on multifaceted roles as a team lead and team member. This experience provided me with leadership and collaboration skills, enabling me to make impactful contributions to the company's success. \n\nAs the leader of the Cloud team, I spearheaded an evaluation of diverse Azure services, using my certification in Azure Fundamentals from Microsoft. Furthermore, I took an active role in comprehensive database design, where I crafted an efficient Entity-Relationship Diagram (ERD) and established a robust database infrastructure customized to meet Smash's unique requirements. Leveraging the capabilities of Azure SQL Database and SQL to ensure optimal performance and scalability for our database.\n\nBesides, the successful implementation of agile methodologies, particularly through Linear application, enabled our team to achieve productivity and collaboration excellence during the sprint. We fostered effective communication through the utilization of Discord, with dedicated team channels and Google Drive for streamlined document sharing and notes. Another accomplishment during this internship was securing Smash's entry into the prestigious Microsoft for Startups Program. "
        },

        {
            "time": "2:00 PM - 2:30 PM",
            "projectId": "csse-3-200",
            "title": "Virtual Outfit Planner",
            "studentName": "Roman Phillip Gofman\n\nSanket Karma",
            "studentMajor": "CSSE\n\nCSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Dr. Arkady Retik",
            "posterLink": "posters/csse/karnasanket_4198288_108489990_Sanket Karna Poster.jpg",
            "abstract" : "The main aim of this capstone project was to design and develop an outfit design software where a user can create and manage the clothes in their possession using their wardrobes. The project was divided into three distinct functionalities: user accounts, image processing and serialization, and outfit creation. Culminating in a streamlined system where a user can create an outfit from the images they uploaded.\n\nThe way we approached creating this application was through some user-based research to see what prospective users would want from this application. After this, we did our own research to find the best possible ways to make this app convenient and easy to use for the problem we are solving. We found that using a three-tier architecture was the best way to implement a cloud-based web application with database functionality.\n\nThe problem we sought to solve was the looming stress of planning an outfit every morning, to which the solution through our research came about making an outfit planner with a virtual wardrobe. We found that Google’s Vision API could be used to process images of clothing items uploaded by the users. The result of the image processing gives us some valuable information which we then use to categorize the clothing for easier selection. \n\nWe used a Flask app to run our web page locally. Our webpage was built using HTML, CSS, and JavaScript. And the server side of the code, all in Python, implementing object-oriented principles, was then used to have connections from the database to the front end. The database schemas were written in MySQL utilizing Azure SQL Databases.\n\nThe key to this project was maintaining open lines of communication as well as version control through our GitHub. Despite challenges we maintained persistence to having at a minimum 3 meetings per week to share the state of our respective sections."
        },

        {
            "time": "2:30 PM - 3:00 PM",
            "projectId": "csse-3-230",
            "title": "LingoMon: 2D Language Learning Game",
            "studentName": "Ali Kassim Ibrahim\n\nMickey Girmai\n\nDavid Oganov",
            "studentMajor": "CSSE\n\nCSSE\n\nCSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Dr Arkady Retik",
            "posterLink": "posters/csse/ibrahimalikassim_4171030_108489870_abstract.png",
            "abstract" : "For my Capstone I worked with two other students in making Lingomon, a 2D, Pokemon inspired, language learning game. My contributions to the project existed primarily in Unity including creating the outdoor/indoor tilemaps, NPCs, character animations, gameplay transitions, cutscenes, story system, and various in-game UI features. \n\nMy work with the tilemaps, NPCs, animations, and cutscenes helped in building the foundation of the game's environment and gameplay. This foundation was made in order to provide the tools needed to efficiently build a pleasing gameplay experience that was easy to expand upon and change with little to no code manipulation due to the design of said tool implementations. The story system allowed our MVP to give direction to the player and guide them through their experience, utilizing my teammates' work on the core gameplay functionalities, such as battling, I was able make tasks that were assigned progressively to the player as they learned more about the game and improved at the language they were learning. The cutscenes and gameplay transitions helped polish the game and improve gameplay immersion. Lastly, my work with the in-game UI features including a mini map and settings/options, helped guide the player and provide industry standard features seen amongst modern games. \n\nFrom my work, we were able to build Lingomon to have an intuitive gameplay loop and an appealing modern design that was implemented in a scalable fashion meaning our MVP could be expanded upon easily. My contributions were significant not only in what they provided to the player, but in the flexibility it gave to us as developers to where building different cutscenes, NPC interactions, and storylines were agile and required little work in expanding their features and creating unique instances of these gameplay components. \n\nMy overall job in this project was to build the basis of the game, story, and player quality-of-life/experience. It was through consistent communication with my team that we were able to identify needed features and changes for the game that ultimately lead to a complete and thoroughly polished final product."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-3-330",
            "title": "Machine Learning Development Internship",
            "studentName": "Shihua Yu",
            "studentMajor": "CSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Dr Arkady Retik",
            "posterLink": "posters/csse/yuyouseihua_LATE_4027587_108523637_Shihua Yu_poster.png",
            "abstract": "In the ever-evolving landscape of automation, the precise manipulation of objects by machine arms has emerged as a critical facet. The project revolves around the development of the Robotic Trigger System, a pivotal component of the Capstone Project. The goal is to establish an interface that facilitates seamless user control of the machine arm, streamlining operations for optimal efficiency. \n\nIndeed, the goal of creating an intuitive and efficient interface for controlling machine arms was successfully accomplished through the development of the Robotic Trigger System. This system effectively enables users to interact with and manipulate machine arms with ease, streamlining operations and optimizing task execution. The integration of user-centered design principles, comprehensive system architecture, proficient coding practices, and a robust testing strategy collectively contributed to the realization of this goal.\n\nThe successful realization of the Robotic Trigger System was facilitated by a strategic blend of key tools and technologies. Leveraging the power of C++ and Python programming languages, the project's development phase was orchestrated within the versatile environment of Visual Studio Code (VSC). This integration enabled the seamless translation of user commands into machine actions, resulting in an intuitive and functional interface for controlling machine arms.\n\n The potential impact of the solution is substantial and far-reaching. By seamlessly integrating user interface design, system architecture, and coding proficiency, the Robotic Trigger System stands to revolutionize the landscape of automation. Its intuitive interface empowers users to efficiently control machine arms, streamlining operations across various industries. This innovation holds the promise of enhanced productivity, reduced errors, and optimized task execution.\n\nThrough this project, I have acquired a multifaceted set of skills and insights that span design, coding, and problem-solving. The journey of developing the Robotic Trigger System has deepened my understanding of user-centered design principles, honed my proficiency in coding languages like C++ and Python, and provided practical experience in crafting efficient and intuitive user interfaces. Beyond technical expertise, the project has fostered a nuanced grasp of system architecture and the importance of comprehensive testing strategies for ensuring reliability. Furthermore, I have enriched my ability to collaboratively integrate various components into a coherent and functional whole. This project's impact extends beyond the technical realm, as it has fortified my problem-solving skills, imbued me with an understanding of the intricacies of automation, and bolstered my appreciation for the symbiotic relationship between technology and user satisfaction."
        },
	{
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-3-315",
            "title": "Coordinated multi-drone aerial performance development",
            "studentName": "Andy Boraphet",
            "studentMajor": "CSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Dr Arkady Retik",
            "posterLink": "posters/csse/boraphetandy_LATE_4029727_108495970_CSS 497 Poster Andy Boraphet1.png",
            "abstract":"The purpose of this project is to create a working model of aerial performance (lightshow) with multiple drones. Using sensitive GPS antenna equipment, the goal is to have a high-fidelity drone that takes commands from software in order to coordinate flightpaths. \n\nComponents for the drone needed to be thoroughly researched and selected in order to ensure a high-quality product. The same goes for the software which will be the control APIs that command the flight paths and lights. The project utilizes cutting-edge GPS equipment (F9P) compared to drones that are used currently (M8N). The difference between these two GPS versions is that M8N has a tolerance of 2 meters, while the new F9P has a tolerance of 2 centimeters. \n\nThe goal for this project is to expand to multiple drones coordinating with music while performing choreal light sequences to produce a fluid image from afar. I am doing an MVP, minimum viable product, a “hello world” concept, in order to see if this is possible. \n\nA contributing factor to how this GPS is so accurate is that it requires a sophisticatedground station to communicate to multiple, ~40, satellites from multiple nations: US, EU,Russia, and China. \n\nWhile using flight path software Ardupilot and Mission Planner to control the drone andusing SkyBrush to control the LED lights, C programming language is used to interactwith the flight controller that is using ARM."
        }

    ]
}

