{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-2-100",
            "title": "2D Cloth and Physics Engine",
            "studentName": "Martin Matsudaira",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Erika Parsons",
            "posterLink": "posters/csse/matsudairamartinkenji_3895161_108495052_Martin_Matsudaira_CSS497_Poster.png",
            "abstract": "The goal of this project is to create a game developer-friendly game engine with an integrated physics engine for simulating cloth physics in JavaScript. This self-proposed project aims to understand the significance and development of real-time physics engines.\n\nAll code and files can be exported as a library for game and application development. The project features node and spring objects, along with a procedurally generated mesh object using node and spring prefabs.\n\nThroughout development, addressing performance issues was crucial for real-time rendering and operation. Efficient data structures were designed to traverse and retrieve data for mesh generation. Verlet Integration was used to maintain realistic physics behavior, calculating position and interactions within the mesh object. The physics engine was optimized for real-time operation, relying on an object's previous position to ensure accuracy and handle frame drops.\n\nAs a result, this project enables game developers to create and customize physics-enabled mesh objects. Potential applications for the new mesh object and physics engine include soft-body simulation and interactive elements in games. These specialized features empower game developers to incorporate physics into objects, enhancing realism and predictability beyond basic linear calculations."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-2-115",
            "title": "Software Engineering Interview Preparation",
            "studentName": "Blake Dupar",
            "studentMajor": "CSSE",
            "projectType": "Faculty research",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "posters/csse/duparblake_LATE_4170480_108505156_CapstonePoster.png",
            "abstract": "Transitioning from academic learning to real-world software engineering roles is a challenging process, often punctuated by the daunting hurdle of technical interviews. In the software engineering education landscape, there is a void between the knowledge acquired and the aptitude required for successful technical interview outcomes. Addressing this disparity was the central objective of this capstone project. \n\nThe project entailed creating a two-step tool to bolster student confidence and prepare for technical interviews. The initial component was a Canvas course crafted as a comprehensive study guide. This curated course, with challenges, helpful web pages, and video content, was designed to offer students an exhaustive preparation path, giving them the fundamental tenets of technical interviewing. The trajectory of the course imparts knowledge and instills confidence in problem-solving, indispensable assets in an interview scenario.Upon successful completion of the Canvas course, students are given access to the second phase: a specially designed website that provides a unique opportunity for practicing technical interview sessions featuring a scheduling tool for both mentors and students. This site offers students a network of industry mentors willing to volunteer their time where they can hone their skills in low-stress mock interviews and mentoring sessions. This symbiotic model allowed students to gain invaluable feedback and experience while providing mentors with an opportunity to refine their interviewing skills. \n\nThe underlying reason for adopting this dual-structure approach was rooted in the belief that theoretical knowledge, while essential, is only truly learned when combined with practical application. By combining a course-based learning module with real-time practice interviewing, we aimed to offer students a holistic preparation journey. \n\nThe culmination of our efforts was a robust system that can revolutionize technical interview preparation, as it has the potential to go beyond helping only CS students. While our solution does not claim to guarantee success, it unquestionably bridges the current gap, positioning students more favorably in their quest for software engineering roles by giving them the confidence and skills needed to succeed. \n\nIn conclusion, our capstone project was not just an exercise in software development but an endeavor to facilitate a smoother academic-to-industry transition for software engineering students. By combining education with practicality, we have introduced a solution that promises to reshape the landscape of technical interview preparation, making it more accessible, comprehensive, and effective."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-2-130",
            "title": "Technical Interview Preparation",
            "studentName": "Jeff Kern",
            "studentMajor": "CSSE",
            "projectType": "Faculty research",
            "facultyAdvisor": "Mr Mark Kochanski",
            "posterLink": "posters/csse/kernjeff_LATE_4171027_108505273_Kern_CapstonePosterFinal.png",
	"abstract":"This capstone project aimed to help students prepare for technical job interviews in software engineering. Guided by Professor Mark Kochanski, it resulted in a comprehensive tool to build students' skills and confidence for success in these interviews.\n\nThe project consists of two parts for effective interview prep. The first part offers clear explanations of important data structures and sets of four LeetCode questions. These questions cover various difficulty levels, helping students improve problem-solving skills for real interview situations.\n\nThe second part is an innovative online platform, accessible after completing the Canvas course. It lets students connect with industry experts who generously offer mock interviews and mentoring sessions for career growth. The platform uses secure logins for mentors and students, ensuring privacy. Mentors indicate their availability which is then stored in a database. Students can choose slots from an anonymous pool of appointments made from the listed availability.\n\nResearch revealed few comparable resources. This project stands out by offering free educational content and an entirely cost-free platform for students to practice with industry experts, unlike expensive alternatives. The scheduling tool is unique, with a flexible many-to-many anonymous system.\n\nThe outcome is an enriched course and a functional prototype of the scheduling tool ready for use. A network of volunteer industry professionals committed to helping University of Washington Bothell students enhances the project's impact. This initiative is set to become an invaluable resource for software engineering students, boosting their job placement and career success."
	},
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-2-145",
            "title": "Point of Sale Platform For Mehvi Lady",
            "studentName": "Uzair Ahmad",
            "studentMajor": "CSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "posters/csse/ahmaduzair_4198279_108491195_Capstone Poster.jpg",
            "abstract": "For my Capstone at Liberty Mutual, I worked with a team of developers on the Envoy Events project, which was a strategic endeavor that aimed to develop a secure cloud management solution, facilitated through a user-friendly RESTful API, to cater comprehensively to diverse content requirements. The core objective revolved around the seamless facilitation of content storage, retrieval, and searching processes, all while upholding paramount data security measures. \n\n The project's focal points included boosting operational efficiency, curtailing expenditures, and fundamentally refining content management procedures. Central to the project's success was the meticulous revamp of an existing console, a move that yielded significant dividends. Notable outcomes encompassed a marked reduction in errors, the fortification of brand identity, and a markedly enhanced user interface. An innovative wireframe design was judiciously introduced, offering users a trio of search options: Event ID, Event Pipelined ID, and Collection Name. This customized approach to search optimization was instrumental in expediting the entire process, eliciting heightened levels of user contentment. \n\nIn summary, the Envoy Events project successfully navigated the complex landscape of content management by seamlessly integrating a secure cloud solution and a RESTful API. The resulting improvements to the console brought about enhanced usability, error rectification, and a more resonant brand image. The strategic inclusion of tailored search alternatives further elevated the overall user experience, providing compelling evidence of the project's notable accomplishment."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-2-200",
            "title": "Mehvi Lady - Front End Development",
            "studentName": "Shubham Dabra",
            "studentMajor": "CSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "posters/csse/dabrashubham_LATE_4198306_108503329_SHUBHAM.jpg",
            "abstract":"The frontend implementation of a point-of-sale (POS) system for the \"Mehvi Lady Cosmetic\" website was the subject of the capstone project. The main objective was to develop a user-friendly and effective POS interface to improve customer shopping and manage retail operations. \n\nThe initiative aims to accomplish the following main goals:\n\nWhat: For transactions involving cosmetic products on the \"Mehvi Lady Cosmetic\" website, a user-friendly POS interface has to be designed and put into place.\n\nWhy: The goal was to give customers a smooth and enjoyable shopping experience while giving store managers a powerful tool to manage sales and inventories.\n\nResults: A responsive and aesthetically pleasing POS interface that allowed for simple product selection, quick checkout, and real-time inventory updates was the end result. Product scanning, cart management, and payment processing were all included in the UI.\n\nSignificance: The relevance of this project resides in its capacity to improve the cosmetic store's operational effectiveness and overall consumer experience. The POS system aids in boosting user contentment and easing the purchasing process, which increases sales and patron adequacy.\n\nA user-centric and effective transaction experience was effectively handled by the frontend construction of the POS system for the \"Mehvi Lady Cosmetic\" website. The project's results improve the website's functionality while also giving the cosmetic company a crucial instrument to succeed in the world of online retail."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-2-215",
            "title": "GitMatch: A Platform Inspiring Developers",
            "studentName": "Hayden Lauritzen",
            "studentMajor": "CSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "posters/csse/lauritzenhayden_4195273_108494920_LauritzenHayden_CapstonePoster_16-9.png",
            "abstract" : "GitMatch, a web platform developed during my CSS 497 capstone project, serves to link software project owners and developers who share similar interests. Employing agile methodologies, the project aimed to foster open-source community collaboration by facilitating seamless connections between skilled developers and projects aligned with their expertise. The team embraced iterative development, implementing sprints, stand-ups, and sprint reviews to ensure adaptability to evolving requirements. The adoption of continuous integration and continuous deployment (CI/CD) pipelines streamlined testing and deployment processes, enabling consistent quality and rapid evolution.\n\nI contributed significantly as a team member, primarily focusing on backend development deploying AWS Amplify and DynamoDB. By configuring a robust backend infrastructure, I incorporated efficient data storage and retrieval mechanisms through AWS AppSync’s API. Collaborative brainstorming sessions influenced project structure with iterative design and user feedback promoting a user-centric experience. My role extended beyond technical implementation, encompassing feature creation, bug identification and resolution, and the design and execution of unit tests.\n\nThroughout this project, many milestones were achieved: Backend integration utilizing AWS services facilitated secure and scalable data management. The matching algorithm, reflecting user preferences, skills, and project interests. Testing methodologies, including unit and integration testing, ensured robust code quality, and the iterative design process driven by user feedback contributed to an intuitive platform.\n\nThe project’s significance is to bridge the gap between project owners and developers, promoting collaboration, and accelerating open-source project evolution. With the usage of agile practices, user-centric design, and technical proficiency, GitMatch emerges as an example of effective teamwork and practical implementation of software engineering principles. The successful creation of this capstone project is located within our GitHub repository, other documentation, and the current work product accessible at https://www.appmatchbox.com or https://www.gitmatch.io."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-2-230",
            "title": "GitMatch: Inspiring Developers, Empowering Projects",
            "studentName": "Mohammad Zahid",
            "studentMajor": "CSSE",
            "projectType": "Group Project -  Student Defined",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "posters/csse/zahidmohammadadyan_4119278_108493788_GitMatch Capstone Poster (Mohammad Zahid) (3).png",
            "abstract":"In these last 3 months, I worked on GitMatch, a web cloud application, that addresses the challenge of connecting developers with projects that align with their interests and connecting project owners with the assistance they need to progress. GitMatch introduces a two-way approach, enabling project owners and developers to collaborate effectively while gaining real-world experience beyond traditional settings. By enabling users to specify their expertise and interests, GitMatch facilitates meaningful project collaborations. I worked on the front end of the project, creating a seamless UI and the connection between the user and the product. \n\nInformed by market analysis and meticulous data collection, the original Figma designwas refined to resonate with the project's new theme. This design language wasseamlessly translated into the front-end code, with periodic updates to accommodate evolving requirements. \n\nThe front-end, developed using React and Typescript, featured components from the MUI library to enhance user experience. Authentication mechanisms were integrated to enable smooth user interactions and preference management. The development process followed an Agile methodology, characterized by iterative sprints, enabled using tools like Git for version control and collaboration, alongside Visual Studio Code for efficient coding, and Jira for streamlined task tracking and management. This approach facilitated effective task tracking, ensuring seamless skill evaluation through regular meetings. \n\nIn conclusion, the development journey of GitMatch has been rewarding, offering insights into the integration of cutting-edge technologies to address significant challenges in the developer community. Through this project, I gained a deep understanding of the power of React and Typescript in constructing dynamic and engaging user interfaces. My Team was able to demo the product in front of a live audience at Dubhacks Next."
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-2-245",
            "title": "GitMatch: Open-Source Software Contribution Platform",
            "studentName": "Abhimanyu Kumar",
            "studentMajor": "CSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "posters/csse/kumarabhimanyu_4110437_108494646_GitMatchPoster-1.png",
            "abstract": "Students pursuing software engineering as a career typically come across the same challenge of finding experience and software projects to work on for their resume or portfolio. We want to help solve that problem by providing a platform where students can learn and grow their abilities as developers. GitMatch is an online platform that aims to provide the opportunities and resources necessary to create skilled software engineers that can enter the technology industry confident in their abilities. Additionally, our platform serves as a breeding ground for new innovations, providing them with the opportunity to thrive and gain recognition.\n\nIn this project, I worked as the lead engineer to develop the backend software for the platform. Throughout the development, strategic data informed decisions were made regarding the technical architecture as well as the project goals and requirements.\n\n The backend was developed using various Amazon Web Services such as Lambda, AppSync, EC2, DynamoDB, Cognito, OpenSearch, and API Gateway. Other technologies used in development include NodeJS, TypeScript, GraphQL. For the development process, an Agile methodology was followed, and Jira was used for streamlined task tracking and management.\n\nIn conclusion, the development of GitMatch has been a great opportunity to learn about and use technologies such as AWS to address challenges in the developer community. The team had a successful demonstration in front of an audience at DubHacks Next’s Demo Day."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-2-300",
            "title": "Software Engineering Internship at T-Mobile",
            "studentName": "Mankirat Dhaliwal",
            "studentMajor": "CSSE: Info Assurance and Cybersecurity",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "posters/csse/dhaliwalmankirat_4199596_108492801_T-mobile (1920 × 1080 px).png",
            "abstract" : "This abstract provides a concise overview of my experience of the software engineering internship at T-Mobile that I undertook during the summer of 2023. The project that I was a part of had a goal to streamline and improve the device unlocking process through developing a Bulk Override Tool. Which would take a sizable number of IMEIs and unlock them all at once as compared to the prior long and time-consuming method. The new tool would provide an efficient solution for unlocking devices in bulk for various purposes, such as special projects and giveaways.\n\nThe project that I was involved in was the creation of a REST API that leveraged a request ID to retrieve essential data from a database, including requester name, request date, total IMEI count for unlocking, and current status (pending, approved, declined). This innovative tool replaced a cumbersome manual process, significantly reducing time and effort. The internship provided an opportunity to transition from an educational environment to a professional setting, enabling hands-on experience, feedback incorporation, and real-life application in the software development realm.\n\nThis project's significance lies in its contribution to enhancing operational efficiency within the telecommunications industry, thereby improving user experience and service delivery. The developed Bulk Override Tool demonstrates the practical utility of software engineering skills and underscores their relevance in addressing real-world challenges. There is always room for growth in the realm of software engineering where you can be faster, efficient, and more productive."
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-2-315",
            "title": "Securing Login (OAuth testing and Key Vault Integration",
            "studentName": "Sara Bullers",
            "studentMajor": "CSSE",
            "projectType": "Group Project - Student Defined",
            "facultyAdvisor": "Mr. Mark Kochanski",
            "posterLink": "posters/csse/bullerssara_4230590_108495160_SaraB_poster.png",
            "abstract": "My capstone focused on the implementation of a Key Vault within Teaching Tools, an ongoing project that aims to extend and integrate Canvas with Google and Microsoft. \n\nAn Azure Key Vault is a cloud service that allows for the secure storage and access of secrets – such as APIs, passwords, encryption keys, and tokens. It allows for secure, designated access, and therefore guarantee users access to the application without the risk of leaking sensitive information. \n\nThe completion of the implementation of the key vault resulted in the ability to securely store and control the access to passwords, API keys, and tokens, and therefore, greatly reduce the chances of sensitive information to be leaked. By longer needing to store security information in the application, we eliminate the need to make this information part of the code, which greatly reduces the chances that secrets may be accidentally leaked. It also improved the security of the app by managing permission level according to control access policies. This project allowed me to practice Agile development, as well as hands-on experience on developing code through testing and deployment and pair programming.\n\nIn summary, this faculty research project consisted in the design of an architectural framework that allows to the maintenance of confidentiality, integrity, and availability of sensitive data. "
        }
    ]
}

